{"id":"ever","symbol":"$ever","name":"EVER","web_slug":"ever","asset_platform_id":null,"platforms":{"":""},"detail_platforms":{"":{"decimal_place":null,"contract_address":""}},"block_time_in_minutes":0,"hashing_algorithm":null,"categories":["Gaming (GameFi)","Shooting Games"],"preview_listing":true,"public_notice":null,"additional_notices":["No active trades are found for this coin. Please submit a ticket at %{link} if you think this is an error."],"localization":{"en":"EVER","de":"","es":"","fr":"","it":"","pl":"","ro":"","hu":"","nl":"","pt":"","sv":"","vi":"","tr":"","ru":"","ja":"","zh":"","zh-tw":"","ko":"","ar":"","th":"","id":"","cs":"","da":"","el":"","hi":"","no":"","sk":"","uk":"","he":"","fi":"","bg":"","hr":"","lt":"","sl":""},"description":{"en":"Everreach Labs is a next-generation gaming studio and infrastructure provider creating a fully immersive ecosystem where spectators can influence live gameplay. The flagship product, REVENGE, is a first-person shooter (FPS) game that allows viewers to interact directly with matches through Twitch integration and Web3 technology. With a mission to merge competitive gameplay with live audience engagement, Everreach Labs is pioneering a spectator-driven gaming model, combining true asset ownership and sustainable in-game economies. Everreach Labs Key Features REVENGE – The Next Evolution of FPS Games A cutting-edge co-operative first-person shooter that enables live audience participation, allowing spectators to influence matches in real-time through Web3-enabled interactions. Twitch-Integrated Spectator Interactions REVENGE is built from the ground up with Twitch integration at its core. It allows spectators to vote on in-game events, send challenges, and interact with players live in-game, redefining engagement in online gaming. Empower Viewers: Spectators become ‘Oracles’ who can directly influence in-game events, challenges, and outcomes, creating a dynamic and unpredictable battlefield. Enhanced Cooperative Play: Players and viewers collaborate in unique ways, making strategic choices that impact the progression of each match. Streamline the Streaming Process: The built-in Twitch API removes barriers for content creators, making it easier for streamers to engage their audience with interactive features. Foster Stronger Communities: By giving viewers a stake in the gameplay, streamers can build deeper relationships with their audiences, driving engagement and retention. Web3-Driven Player Economy $EVER powers in-game transactions, premium purchases, staking rewards, making it the core currency of the Everreach ecosystem. Multi-Game Ecosystem \u0026 Cross-Platform Integration Beyond REVENGE, Everreach Labs is developing a gaming infrastructure that extends to additional Web3-powered games, expanding the use of $EVER across multiple experiences. Real Asset Ownership \u0026 Trading Players and spectators can buy, sell, and trade in-game assets with full transparency, ensuring a sustainable, player-driven economy. \r\n\r\nWhat is REVENGE ? \r\nREVENGE is a next-generation AAA first-person shooter (FPS) game that combines fast-paced action with deep player-spectator interaction. Built on Ethereum, it leverages Web3 elements to offer unique in-game experiences where spectators can actively influence gameplay in real time. Key features of REVENGE include: • Twitch Integration: Spectators can trigger in-game actions such as sending resources, modifying environments, and trolling players. • Dual Currency System: Featuring an off-chain premium currency called ‘Nets’ and the $EVER token, which provides discounts and utility across multiple games within the Everreach Labs ecosystem. • Abstract Art Direction: A unique visual style that sets it apart from traditional FPS games. • Competitive and Casual Play: Designed to engage both serious gamers and casual audiences through interactive gameplay and esports potential. With a strong focus on community engagement and innovation, REVENGE is shaping the future of interactive gaming by blending Web3 technology, live streaming, and traditional shooter mechanics. \r\n\r\nWhat Is The Utility Of EVER ? \r\n$EVER is the native token of the Everreach Labs ecosystem, designed to power the entire suite of products and services within our universe. This token is pivotal in ensuring a unified, rewarding, and engaging experience for players, creators, and stakeholders within our gaming ecosystem. Key USPs of $EVER: Unified Ecosystem Currency: $EVER serves as the primary currency across all Everreach Labs products, facilitating seamless transactions and interactions. Staking and Rewards: Players can stake their $EVER tokens to earn additional points over time, with rewards based on the duration and amount staked. In-Game Benefits: Players can use $EVER for premium currency conversions, purchasing and crafting exclusive skins and gear that can boost XP gains for you and anyone that plays with you. Purchasing in-game currency with $EVER will also benefit players with up to 20% bonus on their transaction. Earning $EVER: Gameplay Rewards: Players earn $EVER by completing missions, winning battles, and for performing well on various leaderboards. Staking Rewards: Stake $EVER to earn points that can be burned to unlock new tokens, secured through partnerships, giving users the option to redeem their points for these exclusive token rewards. Participation in Events: Engaging in special events, tournaments, and community activities can yield $EVER rewards. Spectator Engagement: Spectators who actively influence games and participate in community votes can earn $EVER for their contributions. Spending $EVER: In-Game Purchases: Use $EVER to buy and craft premium items, cosmetics, skins, and gear from the in-game marketplace. Upgrades and Enhancements: Spend $EVER to upgrade weapons, gear, and other in-game assets. Customizations: Purchase unique customization options, including character skins, emotes, and titles, to personalize your gaming experience. \r\n\r\nHow Many EVER Tokens Are There in Circulation? \r\nThere are currently 2,777,777,777 EVER tokens in circulation. The token allocation is as follows: • 9.6% of the total supply is allocated for the community sale. • 50% is designated for the community. • 5% is allocated to the foundation. • 20.5% is reserved for Team \u0026 Advisors. • 14.9% is allocated to investors. \r\n\r\nWho Are the Founders of Everreach Labs? \r\nEverreach Labs was founded by Nicolas and Ethan, two passionate entrepreneurs with a shared vision to revolutionize Web3 gaming. Nicolas Bougartchev, with a background in private equity and a degree from a top business school in France, turned his lifelong passion for gaming into a career by co-founding Everreach. His strategic mindset and commitment to excellence have been key in assembling a world-class team and driving the company’s vision forward. Ethan Cohen, an entrepreneur since the age of 17, found success in e-commerce and real estate before diving into the crypto space in 2021. Frustrated by the lack of engaging Web3 games, he teamed up with Nicolas to create Everreach, focusing on delivering high-quality, enjoyable gaming experiences. Together, they have brought on board top-tier talent from industry giants like Fortnite, Assassin’s Creed, and Call of Duty, aiming to set new standards in blockchain gaming by blending cutting-edge technology with immersive gameplay and a player-first approach. \r\n\r\nWho Is the Team Building REVENGE? \r\nREVENGE is being developed by a highly experienced team at Everreach Labs, consisting of 22 internal team members and 20 outsourced developers, with extensive backgrounds in AAA game development. The team members have contributed to iconic titles such as Far Cry, Assassin’s Creed, Diablo IV, World of Tanks, and more, bringing a wealth of expertise to the project. Key leadership members and their previous experience include: • Phil O’Connor (Design Director): With 27 years in game development and contributions to 18 titles, primarily AAA open-world shooters, Phil has worked in various studio environments and compiled best practices in his book, The Craft and Science of Game Design: A Video Game Designer’s Manual. His passion lies in creating engaging interactive entertainment experiences. • Ramin Shokrizade (CRO): A pioneer in game economics and physiology for over 25 years, Ramin has contributed to titles such as Project Spark, World of Tanks Blitz, World of Warships, Gods Unchained, and Civilization. He is recognized internationally as a top expert in game ethics and has helped shape regulations for protecting children in online gaming. • Quentin Gabriel (Art Director): With 14+ years in video games, feature films, and animation, Quentin has worked on AAA titles including Assassin’s Creed, The Division 2, Far Cry, Diablo IV, and Skull \u0026 Bones. His expertise in art direction and concept art helps shape unique and immersive worlds. • Aurélien Pocheville (CTO): With over 20 years of experience in the technology and gaming industry, Aurélien led the creation and launch of the NES Classic Edition (NES Mini) at Nintendo. He has also worked on developing emulators and game engines for platforms like Nintendo DS, Wii, Xbox 360, and PS3. His leadership ensures technical excellence across all projects. Together, the Everreach Labs team is focused on delivering a groundbreaking FPS experience with Web3 integration, Twitch interactivity, and cutting-edge gameplay mechanics, setting new standards in the gaming industry.","de":"","es":"","fr":"","it":"","pl":"","ro":"","hu":"","nl":"","pt":"","sv":"","vi":"","tr":"","ru":"","ja":"","zh":"","zh-tw":"","ko":"","ar":"","th":"","id":"","cs":"","da":"","el":"","hi":"","no":"","sk":"","uk":"","he":"","fi":"","bg":"","hr":"","lt":"","sl":""},"links":{"homepage":["https://everreachlabs.io/","https://getrevenge.io"],"whitepaper":"https://drive.google.com/file/d/11btNJgcm2MU9jKlSu_Wt-GworUAN7Rmj/view?usp=sharing","blockchain_site":[],"official_forum_url":["https://x.com/_GETREVENGE_"],"chat_url":["https://discord.com/invite/everreachlabs","https://www.youtube.com/@GET_REVENGE"],"announcement_url":[],"snapshot_url":null,"twitter_screen_name":"everreachlabs","facebook_username":"","bitcointalk_thread_identifier":null,"telegram_channel_identifier":"EverreachLabs","subreddit_url":"https://www.reddit.com","repos_url":{"github":[],"bitbucket":[]}},"image":{"thumb":"https://coin-images.coingecko.com/coins/images/53031/thumb/Everreach_Labs_-_Logo_Mint___Black_BG.png?1743580632","small":"https://coin-images.coingecko.com/coins/images/53031/small/Everreach_Labs_-_Logo_Mint___Black_BG.png?1743580632","large":"https://coin-images.coingecko.com/coins/images/53031/large/Everreach_Labs_-_Logo_Mint___Black_BG.png?1743580632"},"country_origin":"","genesis_date":null,"sentiment_votes_up_percentage":null,"sentiment_votes_down_percentage":null,"watchlist_portfolio_users":15,"market_cap_rank":null,"market_data":{"current_price":{},"total_value_locked":null,"mcap_to_tvl_ratio":null,"fdv_to_tvl_ratio":null,"roi":null,"ath":{},"ath_change_percentage":{"aed":0.0,"ars":0.0,"aud":0.0,"bch":0.0,"bdt":0.0,"bhd":0.0,"bmd":0.0,"bnb":0.0,"brl":0.0,"btc":0.0,"cad":0.0,"chf":0.0,"clp":0.0,"cny":0.0,"czk":0.0,"dkk":0.0,"dot":0.0,"eos":0.0,"eth":0.0,"eur":0.0,"gbp":0.0,"gel":0.0,"hkd":0.0,"huf":0.0,"idr":0.0,"ils":0.0,"inr":0.0,"jpy":0.0,"krw":0.0,"kwd":0.0,"lkr":0.0,"ltc":0.0,"mmk":0.0,"mxn":0.0,"myr":0.0,"ngn":0.0,"nok":0.0,"nzd":0.0,"php":0.0,"pkr":0.0,"pln":0.0,"rub":0.0,"sar":0.0,"sek":0.0,"sgd":0.0,"sol":0.0,"thb":0.0,"try":0.0,"twd":0.0,"uah":0.0,"usd":0.0,"vef":0.0,"vnd":0.0,"xag":0.0,"xau":0.0,"xdr":0.0,"xlm":0.0,"xrp":0.0,"yfi":0.0,"zar":0.0,"bits":0.0,"link":0.0,"sats":0.0},"ath_date":{},"atl":{},"atl_change_percentage":{"aed":0.0,"ars":0.0,"aud":0.0,"bch":0.0,"bdt":0.0,"bhd":0.0,"bmd":0.0,"bnb":0.0,"brl":0.0,"btc":0.0,"cad":0.0,"chf":0.0,"clp":0.0,"cny":0.0,"czk":0.0,"dkk":0.0,"dot":0.0,"eos":0.0,"eth":0.0,"eur":0.0,"gbp":0.0,"gel":0.0,"hkd":0.0,"huf":0.0,"idr":0.0,"ils":0.0,"inr":0.0,"jpy":0.0,"krw":0.0,"kwd":0.0,"lkr":0.0,"ltc":0.0,"mmk":0.0,"mxn":0.0,"myr":0.0,"ngn":0.0,"nok":0.0,"nzd":0.0,"php":0.0,"pkr":0.0,"pln":0.0,"rub":0.0,"sar":0.0,"sek":0.0,"sgd":0.0,"sol":0.0,"thb":0.0,"try":0.0,"twd":0.0,"uah":0.0,"usd":0.0,"vef":0.0,"vnd":0.0,"xag":0.0,"xau":0.0,"xdr":0.0,"xlm":0.0,"xrp":0.0,"yfi":0.0,"zar":0.0,"bits":0.0,"link":0.0,"sats":0.0},"atl_date":{},"market_cap":{},"market_cap_rank":null,"fully_diluted_valuation":{},"market_cap_fdv_ratio":null,"total_volume":{},"high_24h":{"AED":null,"ARS":null,"AUD":null,"BCH":null,"BDT":null,"BHD":null,"BMD":null,"BNB":null,"BRL":null,"BTC":null,"CAD":null,"CHF":null,"CLP":null,"CNY":null,"CZK":null,"DKK":null,"DOT":null,"EOS":null,"ETH":null,"EUR":null,"GBP":null,"GEL":null,"HKD":null,"HUF":null,"IDR":null,"ILS":null,"INR":null,"JPY":null,"KRW":null,"KWD":null,"LKR":null,"LTC":null,"MMK":null,"MXN":null,"MYR":null,"NGN":null,"NOK":null,"NZD":null,"PHP":null,"PKR":null,"PLN":null,"RUB":null,"SAR":null,"SEK":null,"SGD":null,"SOL":null,"THB":null,"TRY":null,"TWD":null,"UAH":null,"USD":null,"VEF":null,"VND":null,"XAG":null,"XAU":null,"XDR":null,"XLM":null,"XRP":null,"YFI":null,"ZAR":null,"BITS":null,"LINK":null,"SATS":null},"low_24h":{"AED":null,"ARS":null,"AUD":null,"BCH":null,"BDT":null,"BHD":null,"BMD":null,"BNB":null,"BRL":null,"BTC":null,"CAD":null,"CHF":null,"CLP":null,"CNY":null,"CZK":null,"DKK":null,"DOT":null,"EOS":null,"ETH":null,"EUR":null,"GBP":null,"GEL":null,"HKD":null,"HUF":null,"IDR":null,"ILS":null,"INR":null,"JPY":null,"KRW":null,"KWD":null,"LKR":null,"LTC":null,"MMK":null,"MXN":null,"MYR":null,"NGN":null,"NOK":null,"NZD":null,"PHP":null,"PKR":null,"PLN":null,"RUB":null,"SAR":null,"SEK":null,"SGD":null,"SOL":null,"THB":null,"TRY":null,"TWD":null,"UAH":null,"USD":null,"VEF":null,"VND":null,"XAG":null,"XAU":null,"XDR":null,"XLM":null,"XRP":null,"YFI":null,"ZAR":null,"BITS":null,"LINK":null,"SATS":null},"price_change_24h":null,"price_change_percentage_24h":null,"price_change_percentage_7d":0.0,"price_change_percentage_14d":0.0,"price_change_percentage_30d":0.0,"price_change_percentage_60d":0.0,"price_change_percentage_200d":0.0,"price_change_percentage_1y":0.0,"market_cap_change_24h":null,"market_cap_change_percentage_24h":null,"price_change_24h_in_currency":{},"price_change_percentage_1h_in_currency":{},"price_change_percentage_24h_in_currency":{},"price_change_percentage_7d_in_currency":{},"price_change_percentage_14d_in_currency":{},"price_change_percentage_30d_in_currency":{},"price_change_percentage_60d_in_currency":{},"price_change_percentage_200d_in_currency":{},"price_change_percentage_1y_in_currency":{},"market_cap_change_24h_in_currency":{},"market_cap_change_percentage_24h_in_currency":{},"total_supply":2777777777.0,"max_supply":2777777777.0,"max_supply_infinite":false,"circulating_supply":null,"last_updated":null},"community_data":{"facebook_likes":null,"reddit_average_posts_48h":0.0,"reddit_average_comments_48h":0.0,"reddit_subscribers":0,"reddit_accounts_active_48h":0,"telegram_channel_user_count":16833},"developer_data":{"forks":0,"stars":0,"subscribers":0,"total_issues":0,"closed_issues":0,"pull_requests_merged":0,"pull_request_contributors":0,"code_additions_deletions_4_weeks":{"additions":null,"deletions":null},"commit_count_4_weeks":0,"last_4_weeks_commit_activity_series":[]},"status_updates":[],"last_updated":null,"tickers":[]}